# 깃허브
https://github.com/wikibook/pymldg-rev

In [3]:
import pandas as pd
import numpy as np

p.36 / array 형태로 저장해야 인덱스2번 사용가능

In [4]:
name_array = np.array(['j', 's', 'm', 'k'])
score_array = np.array([78, 95, 84, 98])

In [5]:
index1 = np.argsort(score_array)
index1

array([0, 2, 1, 3])

In [6]:
print(name_array[index1])

['j' 'm' 's' 'k']

## 43 타이타닉

In [11]:
titanic_df = pd.read_csv('/Users/limkahyun/Desktop/test/train.csv')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
cd

/Users/limkahyun

In [14]:
type(titanic_df)

pandas.core.frame.DataFrame

In [15]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [16]:
titanic_groupby = titanic_df.groupby(by='Pclass')

In [17]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [18]:
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

In [27]:
def get_cat(age):
    cat = ''
    if age <=9: cat = 'child'
    elif age <=19: cat = 'teenager'
    elif age <=60: cat = 'adult'
    else : cat = 'elderly'
        
    return cat

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_cat(x))
titanic_df[['Age', 'Age_cat']].tail()

      Age   Age_cat
886  27.0     adult
887  19.0  teenager
888   NaN   elderly
889  26.0     adult
890  32.0     adult